src/Documents/ОплатаЧерезКассу/ОплатаЧерезКассу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаЧерезКассу</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ОплатаЧерезКассу/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
		Плательщик = ДанныеЗаполнения.Поставщик;
		Заказ = ДанныеЗаполнения.Ссылка;
		Сумма = ДанныеЗаполнения.СуммаЗаказа;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Константы.НесколькоВалют Тогда
		Если  Валюта.Ссылка = Справочники.Валюта.ПустаяСсылка()  Тогда
			  Валюта = Константы.ВалютаПоУмолчанию.Получить();
		  КонецЕсли;
	  Иначе
		  Валюта = Константы.ВалютаПоУмолчанию.Получить();
	КонецЕсли;
КонецПроцедуры
